; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v4 - type_2 ?v1 - type_3)
 	      (pred_2 ?v2 - object ?v1 - type_3)
	      (pred_3 ?v4 - type_2 ?v7 - type_1)
	      (pred_4 ?v4 - type_2 ?v2 - object ?v7 - type_1))

   (:action op_3
       :parameters  (?v4 - type_2 ?v8 ?v6 - type_3)
       :precondition (and  (pred_1 ?v4 ?v8))
       :effect (and  (pred_1 ?v4 ?v6)
		     (not (pred_1 ?v4 ?v8))))

   (:action op_1
       :parameters (?v4 - type_2 ?v5 - object ?v3 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v3) (pred_1 ?v4 ?v3) (pred_3 ?v4 ?v7))
       :effect (and (pred_4 ?v4 ?v5 ?v7)
		    (not (pred_2 ?v5 ?v3)) 
		    (not (pred_3 ?v4 ?v7))))

   (:action op_2
       :parameters (?v4 - type_2 ?v5 - object ?v3 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v5 ?v7) (pred_1 ?v4 ?v3))
       :effect (and (pred_2 ?v5 ?v3)
		    (pred_3 ?v4 ?v7)
		    (not (pred_4 ?v4 ?v5 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_12 obj_03 - type_2
obj_09 obj_02 obj_04 obj_10 - type_1
obj_11 obj_08 obj_05 - type_3
obj_07 obj_06 obj_01 - object)
(:init
(pred_1 obj_12 obj_05)
(pred_3 obj_12 obj_09)
(pred_3 obj_12 obj_02)
(pred_1 obj_03 obj_08)
(pred_3 obj_03 obj_04)
(pred_3 obj_03 obj_10)
(pred_2 obj_07 obj_11)
(pred_2 obj_06 obj_11)
(pred_2 obj_01 obj_08)
)
(:goal
(and
(pred_2 obj_07 obj_05)
(pred_2 obj_06 obj_08)
(pred_2 obj_01 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_12 obj_05) (pred_1 obj_03 obj_05))))
  )
)
)

; plan
1. (op_1 obj_03 obj_01 obj_08 obj_10)
   deleted: (pred_2 obj_01 obj_08) (pred_3 obj_03 obj_10)
   added: (pred_4 obj_03 obj_01 obj_10)
   goals met: 0 of 3
2. (op_3 obj_12 obj_05 obj_08)
   deleted: (pred_1 obj_12 obj_05)
   added: (pred_1 obj_12 obj_08)
   goals met: 0 of 3
3. (op_3 obj_03 obj_08 obj_11)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_11)
   goals met: 0 of 3
4. (op_3 obj_12 obj_08 obj_11)
   deleted: (pred_1 obj_12 obj_08)
   added: (pred_1 obj_12 obj_11)
   goals met: 0 of 3
5. (op_1 obj_03 obj_07 obj_11 obj_04)
   deleted: (pred_2 obj_07 obj_11) (pred_3 obj_03 obj_04)
   added: (pred_4 obj_03 obj_07 obj_04)
   goals met: 0 of 3
6. (op_1 obj_12 obj_06 obj_11 obj_02)
   deleted: (pred_2 obj_06 obj_11) (pred_3 obj_12 obj_02)
   added: (pred_4 obj_12 obj_06 obj_02)
   goals met: 0 of 3
7. (op_3 obj_03 obj_11 obj_05)
   deleted: (pred_1 obj_03 obj_11)
   added: (pred_1 obj_03 obj_05)
   goals met: 0 of 3
8. (op_3 obj_12 obj_11 obj_08)
   deleted: (pred_1 obj_12 obj_11)
   added: (pred_1 obj_12 obj_08)
   goals met: 0 of 3
9. (op_2 obj_03 obj_01 obj_05 obj_10)
   deleted: (pred_4 obj_03 obj_01 obj_10)
   added: (pred_2 obj_01 obj_05) (pred_3 obj_03 obj_10)
   goals met: 1 of 3
10. (op_2 obj_03 obj_07 obj_05 obj_04)
   deleted: (pred_4 obj_03 obj_07 obj_04)
   added: (pred_2 obj_07 obj_05) (pred_3 obj_03 obj_04)
   goals met: 2 of 3
11. (op_2 obj_12 obj_06 obj_08 obj_02)
   deleted: (pred_4 obj_12 obj_06 obj_02)
   added: (pred_2 obj_06 obj_08) (pred_3 obj_12 obj_02)
   goals met: 3 of 3
